{
    "main": {
        "utf8Required": " $csvFile: Die Daten m&uuml;ssen UTF-8 kodiert sein.",
        "emptyCSV": " $csvFile: Die Datei ist leer.",
        "invalidCSV": " $csvFile: Die Spalten passen nicht zum Inhalt (eventuell wurden die Spaltenbezeichner gel&ouml;scht oder verwechselt).",
        "unknownMarkingID": " $csvFile: Es wurde eine unbekannte Korrekturnummer gefunden ($markingId).",
        "unknownMarkingPath": " $csvFile: Die Korrekturdatei konnte nicht gefunden werden ($markingFile).",
        "errorSendMarkings":" $csvFile: Die Korrekturdaten konnten nicht gespeichert werden.",
        "encodeMarkingsError":" $csvFile: Die Korrekturdaten konnten nicht interpretiert werden.",
        "noTransactionData":" $csvFile: Die ermittelte Transaktionsnummer konnte nicht zugeordnet werden.<br/><br/>Hinweise:<br/>1. Das Korrekturarchiv muss von Ihnen erstellt worden sein.<br/>2. Sie m&uuml;ssen das Korrekturarchiv in der richtigen Veranstaltung hochladen.<br/>3. Die erste Zeile der $csvFile muss die Transaktionsnummer enthalten.<br/>4. Die Transaktionsnummern sind 30 Tage g&uuml;ltig.",
        "missingCSV":" $csvFile: Die CSV-Datei konnte nicht, im Archiv, gefunden werden.",
        "csvDescription":" ID = Korrekturnummer (der Ordnername im zip-Archiv)\n POINTS = die erhaltenen Punkte (**dürfen MAXPOINTS überschreiten**)\n MAXPOINTS = die maximale Punktzahl\n OUTSTANDING = die Einsendung war 'besonders gut' (0=nein, 1=ja)(wird nicht verwendet)\n STATUS = der Status der Korrektur (0=nicht eingesendet, 1=unkorrigiert, 2=vorläufig, 3=korrigiert)(wird dem Studenten so angezeigt)\n TUTORCOMMENT = ein Kommentar zur Einsendung (wird dem Studenten und im Korrekturassistenten angezeigt)(kein HTML verwenden, **maximal 255 Zeichen**)\n STUDENTCOMMENT = der Kommentar des Studenten zu seiner Einsendung (Sie können diesen Kommentar nicht verändern)\n FILE = diese Datei (Pfad bezieht sich auf das zip-Archiv, Sie können natürlich auch selbst eine neue Datei hier einfügen) wird als Korrektur dem Studenten angezeigt \n (Sie können das Feld auch leer lassen, dann wird ihm keine Datei angezeigt)\n\n Wenn Sie nur bestimmte Spalten im System aktualisieren möchten, können Sie die übrigen aus der Liste.csv entfernen (ausser --ID, diese Spalte muss immer enthalten sein)."
    }
}